TestCases/PoolBoiling3D_01/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-0.05       0      -0.05)
    ( 0.05       0      -0.05)
    ( 0.05       0.1    -0.05)
    (-0.05       0.1    -0.05)
    (-0.05       0       0.05)
    ( 0.05       0       0.05)
    ( 0.05       0.1     0.05)
    (-0.05       0.1     0.05)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (10 10 10) simpleGrading (1 1 1)
);


edges
(
);

boundary
(

    Base
    {
        type    wall;
        faces
        (
            (1 5 4 0)
        );
    }


    
    Walls
    {
        type    wall;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
			(4 5 6 7)
            (0 1 2 3)
        );
    }
    
    Top
    {
        type    patch;
        faces
        (
            (3 7 6 2)
        );
    }

);

mergePatchPairs
(
);


// ************************************************************************* //
